Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.0.41/samv71/atdf/ATSAMV71J19.atdf
      <value-group caption="" name="RTC_SR__SEC">
        <value caption="No second event has occurred since the last clear." name="NO_SECEVENT" value="0"/>
        <value caption="At least one second event has occurred since the last clear." name="SECEVENT" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_SR__TIMEV">
        <value caption="No time event has occurred since the last clear." name="NO_TIMEVENT" value="0"/>
        <value caption="At least one time event has occurred since the last clear." name="TIMEVENT" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_SR__CALEV">
        <value caption="No calendar event has occurred since the last clear." name="NO_CALEVENT" value="0"/>
        <value caption="At least one calendar event has occurred since the last clear." name="CALEVENT" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_SR__TDERR">
        <value caption="The internal free running counters are carrying valid values since the last read of the Status Register (RTC_SR)." name="CORRECT" value="0"/>
        <value caption="The internal free running counters have been corrupted (invalid date or time, non-BCD values) since the last read and/or they are still invalid." name="ERR_TIMEDATE" value="1"/>
      </value-group>
    </module>
    <module name="RTT" caption="Real-time Timer" id="6081" version="M">
      <register-group name="RTT">
        <register caption="Mode Register" name="RTT_MR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Real-time Timer Prescaler Value" mask="0x0000FFFF" name="RTPRES"/>
          <bitfield caption="Alarm Interrupt Enable" mask="0x00010000" name="ALMIEN"/>
          <bitfield caption="Real-time Timer Increment Interrupt Enable" mask="0x00020000" name="RTTINCIEN"/>
          <bitfield caption="Real-time Timer Restart" mask="0x00040000" name="RTTRST"/>
          <bitfield caption="Real-time Timer Disable" mask="0x00100000" name="RTTDIS"/>
          <bitfield caption="Real-Time Clock 1Hz Clock Selection" mask="0x01000000" name="RTC1HZ"/>
        </register>
        <register caption="Alarm Register" name="RTT_AR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Alarm Value" mask="0xFFFFFFFF" name="ALMV"/>
        </register>
        <register caption="Value Register" name="RTT_VR" offset="0x08" rw="R" size="4">
          <bitfield caption="Current Real-time Value" mask="0xFFFFFFFF" name="CRTV"/>
        </register>
        <register caption="Status Register" name="RTT_SR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Real-time Alarm Status (cleared on read)" mask="0x00000001" name="ALMS"/>
          <bitfield caption="Prescaler Roll-over Status (cleared on read)" mask="0x00000002" name="RTTINC"/>
        </register>
      </register-group>
    </module>
    <module name="SSC" caption="Synchronous Serial Controller" id="6078" version="Q">
      <register-group name="SSC">
        <register caption="Control Register" name="SSC_CR" offset="0x0" rw="W" size="4">
          <bitfield caption="Receive Enable" mask="0x00000001" name="RXEN"/>
          <bitfield caption="Receive Disable" mask="0x00000002" name="RXDIS"/>
          <bitfield caption="Transmit Enable" mask="0x00000100" name="TXEN"/>
          <bitfield caption="Transmit Disable" mask="0x00000200" name="TXDIS"/>
          <bitfield caption="Software Reset" mask="0x00008000" name="SWRST"/>
        </register>
        <register caption="Clock Mode Register" name="SSC_CMR" offset="0x4" rw="RW" size="4">
          <bitfield caption="Clock Divider" mask="0x00000FFF" name="DIV"/>
        </register>
        <register caption="Receive Clock Mode Register" name="SSC_RCMR" offset="0x10" rw="RW" size="4">
          <bitfield caption="Receive Clock Selection" mask="0x00000003" name="CKS" values="SSC_RCMR__CKS"/>
          <bitfield caption="Receive Clock Output Mode Selection" mask="0x0000001C" name="CKO" values="SSC_RCMR__CKO"/>
          <bitfield caption="Receive Clock Inversion" mask="0x00000020" name="CKI"/>
          <bitfield caption="Receive Clock Gating Selection" mask="0x000000C0" name="CKG" values="SSC_RCMR__CKG"/>
          <bitfield caption="Receive Start Selection" mask="0x00000F00" name="START" values="SSC_RCMR__START"/>
          <bitfield caption="Receive Stop Selection" mask="0x00001000" name="STOP"/>
          <bitfield caption="Receive Start Delay" mask="0x00FF0000" name="STTDLY"/>
          <bitfield caption="Receive Period Divider Selection" mask="0xFF000000" name="PERIOD"/>
        </register>
        <register caption="Receive Frame Mode Register" name="SSC_RFMR" offset="0x14" rw="RW" size="4">
          <bitfield caption="Data Length" mask="0x0000001F" name="DATLEN"/>
          <bitfield caption="Loop Mode" mask="0x00000020" name="LOOP"/>
          <bitfield caption="Most Significant Bit First" mask="0x00000080" name="MSBF"/>
          <bitfield caption="Data Number per Frame" mask="0x00000F00" name="DATNB"/>
          <bitfield caption="Receive Frame Sync Length" mask="0x000F0000" name="FSLEN"/>
          <bitfield caption="Receive Frame Sync Output Selection" mask="0x00700000" name="FSOS" values="SSC_RFMR__FSOS"/>
          <bitfield caption="Frame Sync Edge Detection" mask="0x01000000" name="FSEDGE" values="SSC_RFMR__FSEDGE"/>
          <bitfield caption="FSLEN Field Extension" mask="0xF0000000" name="FSLEN_EXT"/>
        </register>
        <register caption="Transmit Clock Mode Register" name="SSC_TCMR" offset="0x18" rw="RW" size="4">
          <bitfield caption="Transmit Clock Selection" mask="0x00000003" name="CKS" values="SSC_TCMR__CKS"/>
          <bitfield caption="Transmit Clock Output Mode Selection" mask="0x0000001C" name="CKO" values="SSC_TCMR__CKO"/>
          <bitfield caption="Transmit Clock Inversion" mask="0x00000020" name="CKI"/>
          <bitfield caption="Transmit Clock Gating Selection" mask="0x000000C0" name="CKG" values="SSC_TCMR__CKG"/>
          <bitfield caption="Transmit Start Selection" mask="0x00000F00" name="START" values="SSC_TCMR__START"/>
          <bitfield caption="Transmit Start Delay" mask="0x00FF0000" name="STTDLY"/>
          <bitfield caption="Transmit Period Divider Selection" mask="0xFF000000" name="PERIOD"/>
        </register>
        <register caption="Transmit Frame Mode Register" name="SSC_TFMR" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Data Length" mask="0x0000001F" name="DATLEN"/>
          <bitfield caption="Data Default Value" mask="0x00000020" name="DATDEF"/>
          <bitfield caption="Most Significant Bit First" mask="0x00000080" name="MSBF"/>
          <bitfield caption="Data Number per Frame" mask="0x00000F00" name="DATNB"/>
          <bitfield caption="Transmit Frame Sync Length" mask="0x000F0000" name="FSLEN"/>
          <bitfield caption="Transmit Frame Sync Output Selection" mask="0x00700000" name="FSOS" values="SSC_TFMR__FSOS"/>
          <bitfield caption="Frame Sync Data Enable" mask="0x00800000" name="FSDEN"/>
          <bitfield caption="Frame Sync Edge Detection" mask="0x01000000" name="FSEDGE" values="SSC_TFMR__FSEDGE"/>
          <bitfield caption="FSLEN Field Extension" mask="0xF0000000" name="FSLEN_EXT"/>
        </register>
        <register caption="Receive Holding Register" name="SSC_RHR" offset="0x20" rw="R" size="4">
          <bitfield caption="Receive Data" mask="0xFFFFFFFF" name="RDAT"/>
        </register>
        <register caption="Transmit Holding Register" name="SSC_THR" offset="0x24" rw="W" size="4">
          <bitfield caption="Transmit Data" mask="0xFFFFFFFF" name="TDAT"/>
        </register>
        <register caption="Receive Sync. Holding Register" name="SSC_RSHR" offset="0x30" rw="R" size="4">
          <bitfield caption="Receive Synchronization Data" mask="0x0000FFFF" name="RSDAT"/>
        </register>
        <register caption="Transmit Sync. Holding Register" name="SSC_TSHR" offset="0x34" rw="RW" size="4">
          <bitfield caption="Transmit Synchronization Data" mask="0x0000FFFF" name="TSDAT"/>
        </register>
